# Plant_GetToolPlantNm

## Description
Gets the current plant that the tool has loaded.

```pascal
FUNCTION Plant_GetToolPlantNm : STRING;
```

```python
def vs.Plant_GetToolPlantNm():
    return STRING
```

## Version
Availability: from Vectorworks 2014

## Category
* PlantObjectCoreTools